Repository: ronignc/netcat
Catalog: po/*.po
Languages: pt_br

source: Listening on %s
pt_br: Escutando em %s

source: Listening on %s (using %d sockets)
pt_br: Escutando em %s (%d socket em uso)

source: Received packet from %s:%d -> %s:%d (local)
pt_br: Pacote recebido de %s:%d -> %s:%d (local)

source: Received packet from %s:%d
pt_br: Pacote recebido de %s:%d

source: %s open
pt_br: %s aberto

source: Couldn't setup listening socket (err=%d)
pt_br: Impossível criar o socket para escutar (err=%d)

source: Unwanted connection from %s:%hu (refused)
pt_br: Conexão indesejada com %s:%hu (recusada)

source: Connection from %s:%hu
pt_br: Conexão com %s:%hu

source: Error:
pt_br: Erro:

source: Warning:
pt_br: Atenção:

source: Notice:
pt_br: Informação:

source: Total received bytes: %s Total sent bytes: %s
pt_br: Total de bytes recebidos: %s Total de bytes enviados: %s

source: Cmd line:
pt_br: Linha de comando:

source: GNU netcat %s, a rewrite of the famous networking tool.
pt_br: GNU netcat %s, uma reimplementação da famosa ferramenta de redes.

source: Basic usages:
pt_br: Uso:

source: connect to somewhere: %s [options] hostname port [port] ...
pt_br: conexão com um host: %s [opções] hostname port [porta] ...

source: listen for inbound: %s -l -p port [options] [hostname] [port] ...
pt_br: escuta conexão: %s -l -p port [opções] [hostname] [porta] ...

source: tunnel to somewhere: %s -L hostname:port -p port [options]
pt_br: modo tunelamento: %s -L hostname:porta -p porta [opções]

source: Mandatory arguments to long options are mandatory for short options too.
pt_br: Os argumentos obrigatórios para as opções longas são obrigatórios para as curtas também.

source: Options: -c, --close close connection on EOF from stdin -e, --exec=PROGRAM program to exec after connect -g, --gateway=LIST source-routing hop point[s], up to 8 -G, --pointer=NUM source-routing pointer: 4, 8, 12, ... -h, --help display this help and exit -i, --interval=SECS delay interval for lines sent, ports scanned -l, --listen listen mode, for inbound connects
pt_br: Opções: -c, --close encerra a conexão ao EOF do stdin -e, --exec=PROGRAM programa a executar depois de se conectar -g, --gateway=LIST source-routing hop point[s], até a 8 -G, --pointer=NUM source-routing pointer: 4, 8, 12, ... -h, --help mostra este texto e sai -i, --interval=SECS intervalo para as linhas enviadas ou portas tentadas. -l, --listen modo de escuta, para as conexões de entrada

source: -L, --tunnel=ADDRESS:PORT forward local port to remote address -n, --dont-resolve numeric-only IP addresses, no DNS -o, --output=FILE output hexdump traffic to FILE (implies -x) -p, --local-port=NUM local port number -r, --randomize randomize local and remote ports -s, --source=ADDRESS local source address (ip or hostname)
pt_br: -L, --tunnel=ADDRESS:PORT repassa uma porta a um endereço remoto -n, --dont-resolve apenas endereços IP numéricos, sem DNS -o, --output=FILE escrive a saída do tráfego em FILE (implica -x) -p, --local-port=NUM especifica a porta local usada -r, --randomize aleatoriza as portas locais e remotas -s, --source=ADDRESS especifica o endereço de destino (ip ou hostname)

source: -t, --tcp TCP mode (default) -T, --telnet answer using TELNET negotiation
pt_br: -t, --tcp modo TCP (padrão) -T, --telnet responde às negociações TELNET

source: --tcp TCP mode (default) -t, --telnet answer using TELNET negotiation -T same as --telnet (compat)
pt_br: --tcp modo TCP (padrão) -t, --telnet responde às negociações TELNET -T igual a --telnet (compatibilidade)

source: -u, --udp UDP mode -v, --verbose verbose (use twice to be more verbose) -V, --version output version information and exit -x, --hexdump hexdump incoming and outgoing traffic -w, --wait=SECS timeout for connects and final net reads -z, --zero zero-I/O mode (used for scanning)
pt_br: -u, --udp modo UDP -v, --verbose detalhado (use duas vezes para mais detalhes) -V, --version mostra informações sobre a versão e sai -x, --hexdump mostra o hexdump dos dados na entrata e na saída -w, --wait=SECS tempo de timeout para as tentativas de conexões -z, --zero modo de zero-I/O (usado para scanning)

source: Remote port number can also be specified as range. Example: '1-1024'
pt_br: A porta remota pode ser especificada como intervalo. Exemplo: '1-1024'

source: Copyright (C) 2002 - 2003 Giovanni Giacobbi This program comes with NO WARRANTY, to the extent permitted by law. You may redistribute copies of this program under the terms of the GNU General Public License. For more information about these matters, see the file named COPYING. Original idea and design by Avian Research <hobbit@avian.org>, Written by Giovanni Giacobbi <giovanni@giacobbi.net>.
pt_br: Copyright (C) 2002 - 2003 Giovanni Giacobbi Este programa é distribuído SEM GARANTIA, na extensão permitida pelas leis aplicáveis. É possível redistribuir cópias deste programa dentro dos termos estabelecidos pela GNU General Public License. Para mais informações a respeito, ver o arquivo COPYING. Projeto e idéia original de Avian Research <hobbit@avian.org>, Escrito por Giovanni Giacobbi <giovanni@giacobbi.net>.

source: Terminated.
pt_br: Terminado.

source: Exiting.
pt_br: Saindo.

source: Couldn't execute %s: %s
pt_br: Impossível executar %s: %s

source: Cannot specify `-e' option double
pt_br: Impossível utilizar as opções `-e' mais vezes

source: Invalid interval time "%s"
pt_br: Tempo de intervalo inválido "%s"

source: You can specify mode flags (`-l' and `-L') only once
pt_br: Pode especificar as flags de modo (`-l' e `-L') apenas uma vez

source: `-L' and `-z' options are incompatible
pt_br: As opções `-L' e `-z' são incompatíveis

source: Invalid target string for `-L' option
pt_br: Especificação inválida de túnel para o parâmetro `-L'

source: Couldn't resolve tunnel target host: %s
pt_br: Impossível resolver o alvo do túnel: %s

source: Invalid tunnel target port: %s
pt_br: Porta inválida do túnel: %s

source: Invalid local port: %s
pt_br: Porta local especificada inválida: %s

source: Invalid tunnel connect port: %s
pt_br: Porta especificada inválida para a conexão do túnel: %s

source: Couldn't resolve local host: %s
pt_br: Porta local inválida: %s

source: Couldn't resolve tunnel local host: %s
pt_br: Impossível resolver o host de conexão por túnel: %s

source: Invalid wait-time: %s
pt_br: Tempo de espera inválido: %s

source: Try `%s --help' for more information.
pt_br: Use `%s --help' para mais informações.

source: `-e' and `-z' options are incompatible
pt_br: As opções `-e' e `-z' são incompatíveis

source: Debugging support not compiled, option `-d' discarded. Using maximum verbosity.
pt_br: Suporte para debug não compilado, opção `-d' ignorada.

source: Randomization support not compiled, option `-r' discarded.
pt_br: Suporte para aleatoriedade não compilado, opção `-r' ignorada.

source: Failed to open output file: %s
pt_br: Impossível abrir o arquivo de saída: %s

source: Couldn't resolve host "%s"
pt_br: Impossível resolver o host "%s"

source: Invalid port specification: %s
pt_br: Especificação inválida de porta: %s

source: Listen mode failed: %s
pt_br: Modo de escuta falhou: %s

source: Passing control to the specified program
pt_br: Controle passado ao programa especificado

source: %s: missing hostname argument
pt_br: %s: falta o parâmetro hostname

source: No ports specified for connection
pt_br: Nenhuma porta especificada para a conexão

source: Inverse name lookup failed for `%s'
pt_br: Resolução inversa falhou para `%s'

source: This host's reverse DNS doesn't match! %s -- %s
pt_br: O DNS reverso deste host não bate! %s -- %s

source: Real hostname for %s [%s] is %s
pt_br: O verdadeiro hostname de %s [%s] é %s

source: Host %s isn't authoritative! (direct lookup failed)
pt_br: O host %s não é autoritativo! (lookup direto falhou)

source: Host %s isn't authoritative! (direct lookup mismatch)
pt_br: O host %s não é autoritativo! (lookup direto errado)

source: %s -> %s BUT %s -> %s
pt_br: %s -> %s MAS %s -> %s

source: any address
pt_br: todos os endereços
